In [1]:
import numpy as np 
import pandas as pd

### 인덱스 조작

### set_index

In [3]:
np.random.seed(0)
df1 = pd.DataFrame(np.vstack([list('ABCDE'),
                              np.round(np.random.rand(3, 5), 2)]).T,
                   columns=["C1", "C2", "C3", "C4"])
df1

  C1    C2    C3    C4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

In [4]:
df2 = df1.set_index('C1')
df2

      C2    C3    C4
C1
A   0.55  0.65  0.79
B   0.72  0.44  0.53
C    0.6  0.89  0.57
D   0.54  0.96  0.93
E   0.42  0.38  0.07

In [6]:
df1.set_index('C1', inplace=True)      # inplace 디폴트는 False 
df1

      C2    C3    C4
C1
A   0.55  0.65  0.79
B   0.72  0.44  0.53
C    0.6  0.89  0.57
D   0.54  0.96  0.93
E   0.42  0.38  0.07

In [7]:
df1

      C2    C3    C4
C1
A   0.55  0.65  0.79
B   0.72  0.44  0.53
C    0.6  0.89  0.57
D   0.54  0.96  0.93
E   0.42  0.38  0.07

### reset index

In [9]:
df1.reset_index()

  C1    C2    C3    C4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

In [10]:
df1

      C2    C3    C4
C1
A   0.55  0.65  0.79
B   0.72  0.44  0.53
C    0.6  0.89  0.57
D   0.54  0.96  0.93
E   0.42  0.38  0.07

In [11]:
df1.reset_index(inplace=True)

In [12]:
df1

  C1    C2    C3    C4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

In [22]:
df_score0 = pd.DataFrame({
    '국어': [80, 20, 30, 50, 70],
    '영어': [90, 50, 50, 70, 60],
    '수학': [80, 80, 70, 50, 40]
}, columns=['국어', '영어', '수학'])
df_score0

   국어  영어  수학
0  80  90  80
1  20  50  80
2  30  50  70
3  50  70  50
4  70  60  40

In [25]:
np.random.seed(2001)
df_score1 = pd.DataFrame(np.random.randint(60, 101, size=(5,3)), columns=['국어', '영어', '수학'])
df_score1

   국어  영어  수학
0  60  64  66
1  76  98  97
2  76  61  60
3  64  83  86
4  64  99  79

In [27]:
df_score1.index = ['kim', 'lee', 'park', 'choi', 'jung']
df_score1.index.name = '이름'
df_score1

      국어  영어  수학
이름
kim   60  64  66
lee   76  98  97
park  76  61  60
choi  64  83  86
jung  64  99  79

In [30]:
df_score2 = df_score1.reset_index()
df_score2

     이름  국어  영어  수학
0   kim  60  64  66
1   lee  76  98  97
2  park  76  61  60
3  choi  64  83  86
4  jung  64  99  79

In [31]:
df_score2.set_index('이름', inplace=True)
df_score2

      국어  영어  수학
이름
kim   60  64  66
lee   76  98  97
park  76  61  60
choi  64  83  86
jung  64  99  79